[
    {
        "drugbank_id": "DB00001",
        "name": "Lepirudin",
        "description": "Lepirudin is a recombinant hirudin formed by 65 amino acids that acts as a highly specific and direct thrombin inhibitor.[L41539,L41569] Natural hirudin is an endogenous anticoagulant found in _Hirudo medicinalis_ leeches.[L41539] Lepirudin is produced in yeast cells and is identical to natural hirudin except for the absence of sulfate on the tyrosine residue at position 63 and the substitution of leucine for isoleucine at position 1 (N-terminal end).[A246609] \r\n\r\nLepirudin is used as an anticoagulant in patients with heparin-induced thrombocytopenia (HIT), an immune reaction associated with a high risk of thromboembolic complications.[A3, L41539] HIT is caused by the expression of immunoglobulin G (IgG) antibodies that bind to the complex formed by heparin and platelet factor 4. This activates endothelial cells and platelets and enhances the formation of thrombi.[A246609] Bayer ceased the production of lepirudin (Refludan) effective May 31, 2012.[L41574]",
        "cas_number": "138068-37-8",
        "unii": "Y43GF64R34",
        "state": "solid",
        "synthesis_reference": "Recombinant hirudin expressed by using yeast secretary (China Patent No. CN1371994A, 2001). China National Intellectual Property Administration. https://patents.google.com/patent/CN1371994A/en",
        "indication": "Lepirudin is indicated for anticoagulation in adult patients with acute coronary syndromes (ACS) such as unstable angina and acute myocardial infarction without ST elevation. In patients with ACS, lepirudin is intended for use with [aspirin].[L41539] Lepirudin is also indicated for anticoagulation in patients with heparin-induced thrombocytopenia (HIT) and associated thromboembolic disease in order to prevent further thromboembolic complications.[L41539]",
        "pharmacodynamics": "Lepirudin is a recombinant hirudin that acts as a highly specific thrombin inhibitor. Its activity is measured by anti-thrombin units (ATUs) that correspond to the amount of lepirudin required to neutralize a unit of the World Health Organization α-thrombin (89/588) standard. The activity of lepirudin is 16,000 ATU/mg.[L41539,L41569] A single molecule of lepirudin binds to a molecule of thrombin, blocking its thrombogenic activity. This drug increases activated partial thromboplastin time (aPTT)  and PT (INR) values in a dose-dependent manner, and its mode of action is independent of antithrombin III.[L41539,L41569] Platelet factor 4 does not inhibit lepirudin.[L41539,L41569]\r\n\r\nThe pharmacodynamic effect of lepirudin was evaluated by measuring an increase in aPTT. No saturable effect was observed at the highest tested dose (0.5 mg/kg, IV bolus).[L41539] Thrombin time was considered an unsuitable routine test for lepirudin monitoring due to the high values detected (200 seconds) even at low doses.[L41539] The concomitant use of thrombolytic therapy and lepirudin is not recommended due to the high risk of bleeding that may be life-threatening. In patients with a risk of bleeding, a physician should weigh the risks of lepirudin administration against its benefits.  There is also an especially high risk of bleeding in patients who weigh less than 50 kg, and a lower dosage is required. Patients with renal impairment have a higher risk of hemorrhagic adverse events.[L41539]",
        "mechanism_of_action": "Lepirudin is a direct thrombin inhibitor used as an anticoagulant in patients for whom heparin is contraindicated.[L41539,A3] Thrombin is a serine protease that participates in the blood-clotting cascade, and it is formed by the cleavage of pro-thrombin. Active thrombin cleaves fibrinogen and generates fibrin monomers that polymerize to form fibrin clots.[A246624]\r\n\r\nLepirudin binds to the catalytic and substrate-binding sites of thrombin, forming a stable, irreversible and non-covalent complex.[A246609] This blocks the protease activity of thrombin and inhibits the coagulation process. Each molecule of lepirudin binds to a single molecule of thrombin,[L41539] and unlike [heparin], it is able to inhibit thrombin in both its clot-bound or free states.[A246609]",
        "toxicity": "The acute toxicity of intravenous lepirudin was evaluated in mice (0.1-1000 mg/kg), rats (1-1000 mg/kg), and monkeys (1-100 mg/kg), and toxicity was not detected at the doses investigated.[L41539] The acute toxicity of lepirudin administered subcutaneously was also evaluated in mice (1-1250 mg/kg) and rats (1-500 mg/kg), and no toxicity was detected.[L41539] One rat (100 mg/kg) died of rapid blood loss after the subcutaneous administration of lepirudin. Reactions to local injections such as hemorrhages, hematomas and/or nodules were detected in mice and rats given subcutaneous doses of lepirudin equal or higher than 500 mg/kg and 10 mg/kg, respectively.[L41539] \r\n\r\nChronic toxicity was evaluated in rats and monkeys given lepirudin for up to 3 months. Most of the effects observed were due to the antithrombotic action of lepirudin. After 3 months, hemosiderin deposits in the spleen and moderate sinus histiocytosis in the lymph node were observed in rats. In monkeys, external and internal hemorrhages and hematomas were detected.[L41539] Lepidurin was reported as not mutagenic.[L41539]\r\n\r\nRelative overdose may occur in patients with renal impairment, therefore, bolus dose and rate of infusion must be reduced in case of known or suspected renal insufficiency.[L41539] Excessively high activated partial thromboplastin time (aPTT) values suggest an overdose and a risk of bleeding. Lepirudin has no known antidote. In case of life-threatening bleeding and if excessive plasma levels of lepirudin are suspected: 1)stop the administration of lepirudin immediately, 2) determine aPTT and coagulation parameters, 3) determine hemoglobin, and prepare for a transfusion, 4) follow the treatment guidelines for patients with shock.[L41539] Hemofiltration or hemodialysis may be useful in case of overdose, based in single case reports and animal data.[L41539]",
        "metabolism": "As a polypeptide, lepirudin is expected to be metabolized by the sequential cleavage of amino acids by kidney exoproteases, which have carboxypeptidase and dipeptidase-like activity.[L41539,L41544] The C-terminal cleavage of lepirudin aminoacids (aminoacids 1 to 65) produces four metabolites with anti-thrombotic activity: M1 (aminoacids 1 to 64), M2 (aminoacids 1 to 63), M3 (aminoacids 1 to 62), and M4 (aminoacids 1 to 61).[L41544]",
        "absorption": "Lepirudin administered as a single intravenous bolus injection of 0.4 mg/kg in 9 healthy volunteers (male and female) resulted in a C<sub>max</sub> of 2924 ng/mL, a t<sub>max</sub> of 0.17 h and an AUC<sub>0-∞</sub> of 2500 ng•h/mL.[L41539] When 0.1, 0.15 and 0.2 mg/kg of lepirudin was administered as a single intravenous infusion over 6 hours in healthy male volunteers, lepirudin had a corresponding C<sub>max</sub> of 111, 203, and 2446 ng/mL and a corresponding AUC of 612, 1184, and 1446 ng•h/mL.[L41544] Bioavailability is 100% following injection. Also, it has been reported that following subcutaneous (sc) administration, the bioavailability of lepirudin is almost 100%.[A246609]",
        "half_life": "Lepirudin has an initial half-life of approximately 10 minutes, and in young healthy volunteers, it has a terminal half-time of 1.3 hours.[L41539] Lepirudin has a first-order elimination kinetic; plasma concentration increases proportionally as the lepirudin intravenous dose is increased. Elimination half-life values of up to 2 days were detected in patients with marked renal insufficiency (creatinine clearance < 15 mL/min).[L41539]",
        "protein_binding": "In human plasma, the protein binding of lepirudin was approximately 3%.[L41539]",
        "route_of_elimination": "Lepirudin is mostly excreted through urine (48.3%). About 35% of lepirudin is excreted unchanged, while metabolites are found in a smaller proportion (2.5% of M1, 5.4% of M2, 3.9% of M3 and 1.6% of M4).[L41544]",
        "volume_of_distribution": "The volume of distribution of lepirudin at steady state was 12.2 L in healthy young subjects (n=18, 18-60 years), 18.7 L in healthy elderly subjects (n=10, 65-80 years), 18.0 L in renally impaired subjects (n=16, creatinine clearance < 80 mL/min, and 32.1 L in heparin-induced thrombocytopenia patients (n=73).[L41539] The distribution of lepirudin is mainly restricted to extracellular fluids.[L41539]",
        "clearance": "The clearance of lepirudin is proportional to the glomerular filtration rate. On average, lepirudin clearance was 164 mL/min in healthy young subjects (n=18, 18-60 years) and 25% lower in women than in men. In healthy elderly subjects (n=10, 65-80 years), clearance was 139 mL/min, about 20% lower than in younger patients.[L41539] This is possibly due to the lower creatinine clearance in elderly patients. In renally impaired subjects (n=16, creatinine clearance < 80 mL/min), clearance was 61 mL/min, and in heparin-induced thrombocytopenia patients (n=73), it was 114 mL/min.[L41539]"
    },
    {
        "drugbank_id": "DB00002",
        "name": "Cetuximab",
        "description": "Cetuximab is a recombinant chimeric human/mouse IgG1 monoclonal antibody that competitively binds to epidermal growth factor receptor (EGFR) and competitively inhibits the binding of epidermal growth factor (EGF).[A227973] EGFR is a member of the ErbB family of receptor tyrosine kinases found in both normal and tumour cells; it is responsible for regulating epithelial tissue development and homeostasis.[A228083] EGFR has been implicated in various types of cancer, as it is often overexpressed in malignant cells [A227973] and EGFR overexpression has been linked to more advanced disease and poor prognosis.[A227963] EGFR is often mutated in certain types of cancer and serves as a driver of tumorigenesis.[A228083] _In vitro_, cetuximab was shown to mediate anti-tumour effects in numerous cancer cell lines and human tumour xenografts.[A227963]\r\n\r\nApproved by the FDA in February 2004 under the brand name ERBITUX, cetuximab is used for the treatment of head and neck cancer and metastatic, KRAS wild-type colorectal cancer, and metastatic colorectal cancer with a BRAF V600E mutation.[A227963,L39045] It has also been investigated in advanced colorectal cancer, EGFR-expressing non-small cell lung cancer (NSCLC), and unresectable squamous cell skin cancer.[L31418] Cetuximab is administered via intravenous infusion and is used as monotherapy or in combination with other chemotherapies, including platinum agents, radiation therapy, [leucovorin], [fluorouracil], and [irinotecan].[L30448]",
        "cas_number": "205923-56-4",
        "unii": "PQX0D8J21J",
        "state": "liquid",
        "synthesis_reference": null,
        "indication": "Cetuximab indicated for the treatment of locally or regionally advanced squamous cell carcinoma of the head and neck in combination with radiation therapy. It is indicated for treating a recurrent locoregional disease or metastatic squamous cell carcinoma of the head and neck in combination with platinum-based therapy with fluorouracil. It is indicated for recurrent or metastatic squamous cell carcinoma of the head and neck progressing after platinum-based therapy.[L30448]\r\n\r\nCetuximab is also indicated for K-Ras wild-type, EGFR-expressing, metastatic colorectal cancer as determined by an FDA-approved test in combination with FOLFIRI, a chemotherapy combination that includes [leucovorin], [fluorouracil], and [irinotecan]; in combination with irinotecan in patients who are refractory to irinotecan-based chemotherapy; or as monotherapy in patients who have failed oxaliplatin- and irinotecan-based chemotherapy or who are intolerant to irinotecan.[L30448]\r\n\r\nAdditionally, cetuximab is also indicated for metastatic colorectal cancer that is BRAF V600E mutation-positive (as determined by an FDA-approved test) in combination with [encorafenib] but only after prior therapy.[L39045]\r\n\r\nCetuximab is not indicated for the treatment of Ras-mutant colorectal cancer or when the results of the Ras mutation tests are unknown.[L30448]",
        "pharmacodynamics": "Cetuximab is an anticancer agent that works by inhibiting the growth and survival of epidermal growth factor receptor (EGFR)-expressing tumour cells with high specificity and higher affinity than epidermal growth factor (EGF) and transforming growth factor-alpha (TGF-α), which are natural ligands of EGFR.[L31418] Cetuximab works by inhibiting the growth and survival of EGFR-positive tumours.[A227963] _In vitro_, it promotes antibody-dependent cellular cytotoxicity (ADCC) against certain human tumour types. On the contrary, cetuximab does not exert its anti-tumour effects on human tumour xenografts lacking EGFR expression.[A227963, L30448]\r\n\r\nCetuximab potentiates the cytotoxic effects of chemotherapeutics and radiation therapy when used in combination.[L30448] In human tumour xenograft models in mice, cetuximab and irinotecan synergistically inhibited the growth of orthotopic anaplastic thyroid carcinoma xenografts _in vitro_ and _in vivo_. Cetuximab potentiated the _in vitro_ anti-proliferative and pro-apoptotic effect of irinotecan and achieved 93% _in vivo_ inhibition of tumour growth when combined with irinotecan, compared to 77% and 79% inhibition when cetuximab and irinotecan were used alone, respectively.[A227978]",
        "mechanism_of_action": "The epidermal growth factor receptor (EGFR) is a transmembrane glycoprotein and a type I receptor tyrosine kinase expressed on both normal and malignant cells. It has been investigated as a therapeutic target for anticancer treatment, as it is often upregulated in cancer types, including head and neck, colon, and rectal cancers.[L30448] When activated by its ligand, EGFR undergoes a conformational change and dimerization to form homodimers or heterodimers with another member of the ErbB family of receptors. Dimerization of EGFR activates the intracellular tyrosine kinase region of EGFR and promotes autophosphorylation, initiating a series of downstream signalling cascades, including cell differentiation, proliferation, migration, angiogenesis, and apoptosis. This EGFR signalling pathway is often dysregulated in cancer cells, leading to aberrant cell growth and enhanced cell survival.[L31418]\r\n\r\nCetuximab is a monoclonal antibody that binds specifically to the EGFR on both normal and tumour cells to competitively inhibit the binding of epidermal growth factor (EGF) and other ligands that are produced by normal and tumour tissue epithelial cells.[A11, L30448] Upon binding to domain III of EGFR - which is the binding site for its growth factor ligands - cetuximab prevents the receptor from adopting an extended conformation and thereby inhibits EGFR activation, as well as phosphorylation and activation of receptor-associated kinases (MAPK, PI3K/Akt, Jak/Stat).[A11, A228078] Inhibition of the EGFR signalling pathway ultimately leads to inhibition of cell cycle progression, cell survival pathways, and tumour cell motility and invasion.[A227963] Cetuximab also induces cell apoptosis and decreases matrix metalloproteinase and vascular endothelial growth factor (VEGF) production.[A228078, L30448] _In vitro_, cetuximab was shown to inhibit tumour angiogenesis.[A227978] Binding of cetuximab to EGFR also results in internalization of the antibody-receptor complex, leading to an overall downregulation of EGFR expression.[A227973]\r\n\r\nK-ras is a small G-protein downstream of EGFR that plays an important role in promoting the EGFR signalling cascade: in some malignant cells, K-ras can acquire activating mutations in exon 2 [L31418] and thus be continuously active regardless of EGFR regulation.[L30448] Since mutant Ras proteins can isolate the pathway from the effect of EGFR, K-Ras mutations can render EGFR inhibitors like cetuximab ineffective in exerting anti-tumour effects.[L30448, L31418] Cetuximab is thus only limited in its use for K-Ras wild-type, EGFR-expressing cancers.[L30448]",
        "toxicity": "The intravenous LD<sub>50</sub> is > 300 mg/kg in mice and > 200 mg/kg in rats.[L31408] There is limited information on the overdose from cetuximab.\r\n\r\nIn clinical trials, cetuximab was associated with serious and fatal infusion reactions, cardiopulmonary arrest or sudden death, and serious dermatologic toxicities. Pulmonary toxicities, such as interstitial lung disease, interstitial pneumonitis with non-cardiogenic pulmonary edema, and exacerbation of pre-existing fibrotic lung disease have been reported.[L30448]",
        "metabolism": "Like other monoclonal antibodies, cetuximab is expected to undergo lysosomal degradation by the reticuloendothelial system and protein catabolism by a target‐mediated disposition pathway.[A40006]",
        "absorption": "After administration of a 400 mg/m^2 initial dose followed by a 250 mg/m^2 weekly dose, the steady-state levels of cetuximab was reached by the third weekly infusion with mean peak and trough concentrations across studies ranging from 168 µg/mL to 235 µg/mL and 41 µg/mL to 85 µg/mL, respectively.[L30448] T<sub>max</sub> is about 3 hours.[A227963]",
        "half_life": "After administration of a 400 mg/m^2 initial dose followed by a 250 mg/m^2 weekly dose, the mean half-life for cetuximab was approximately 112 hours, with a range of 63 to 230 hours.[L30448]",
        "protein_binding": "There is no information available.",
        "route_of_elimination": "There is limited information available.",
        "volume_of_distribution": "The volume of the distribution is about 2-3 L/m^2 and is independent of dose.[L30448]",
        "clearance": "In patients with recurrent and/or metastatic squamous cell carcinoma of the head and neck, the estimated clearance rate was 0.103 L/h.[A228003] At doses ranging from 200 to 400 mg/m^2, complete saturation of systemic clearance was observed. In a population pharmacokinetic study,  female patients had a 25% lower intrinsic cetuximab clearance than male patients, although there was no evidence of the need for dose modification based on sex.[A227963]"
    },
    {
        "drugbank_id": "DB00003",
        "name": "Dornase alfa",
        "description": "Dornase alfa is a biosynthetic form of human deoxyribunuclease I (DNase I) enzyme. It is produced in genetically modified Chinese hamster ovary (CHO) cells using recombinant DNA technology. The 260-amino acid sequence of dornase alfa is identical to the endogenous human enzyme. Dornase alfa cleaves extracellular DNA to 5´-phosphodinucleotide and 5´-phosphooligonucleotide end products without affecting intracellular DNA. In individuals with cystic fibrosis, extracellular DNA, which is an extremely viscous anion, is released by degenerating leukocytes that accumulate during inflammatory responses to infections. Enzymatic breakdown of this extracellular DNA appears to reduce sputum viscosity and viscoelasticity.",
        "cas_number": "143831-71-4",
        "unii": "953A26OA1Y",
        "state": "liquid",
        "synthesis_reference": null,
        "indication": "Used as adjunct therapy in the treatment of cystic fibrosis. ",
        "pharmacodynamics": "Cystic fibrosis (CF) is a disease characterized by the retention of viscous purulent secretions in the airways. These thick secretions contribute both to reduced pulmonary function and to frequent pulmonary infection. Purulent pulmonary secretions of individuals with cystic fibrosis contain very high concentrations of extracellular DNA released by degenerating leukocytes that accumulate in response to these infections. Dornase alfa hydrolyzes the DNA in sputum of CF patients and reduces sputum viscosity and viscoelasticity. The enzyme does not appear to affect sputum in the absence of an inflammatory response to infection, nor does it affect the sputum of healthy individuals. ",
        "mechanism_of_action": "Dornase alfa is a biosynthetic form of human DNase I. The enzyme is involved in endonucleolytic cleavage of extracellular DNA to 5´-phosphodinucleotide and 5´-phosphooligonucleotide end products. It has no effect on intracellular DNA. Optimal activity is dependent on the presence of divalent cations such as calcium and magnesium. Extracellular DNA is a viscous anionic polymer and its breakdown appears to improve the viscosity and viscoelasticity of purulent sputum of individuals with CF, thus reducing airflow obstruction. Dornase alfa does not seem to have any effect on non-purulent sputum.",
        "toxicity": "Adverse reactions occur at a frequency of < 1/1000 and are usually mild and transient in nature. Reported adverse effects include chest pain (pleuritic/non-cardiac), fever, dyspepsia, voice alteration (hoarseness), pharyngitis, dyspnea, laryngitis, rhinitis, decreased lung function, rash, urticaria, and conjunctivitis. There is no evidence of carcinogenic or mutagenic properties. The safety of dornase alfa has not been studied in pregnant women, nursing women and children under the age of 5 years old. ",
        "metabolism": "While no conclusive studies have yet been published, dornase alfa is expected to be metabolized by proteases in biofluids. ",
        "absorption": "Studies in rats and monkeys after inhalation of dornase alfa shows very little systemic absorption (less than 15% for rats and less than 2% for monkeys). The results were also witnessed in patients. Dornase alfa is also associated with very low accumulation with no serum concentration greater than 10ng/mL observed no matter the dose administered. Bioavailability: mean sputum concentrations of dornase alfa can be measured after 15 minutes. Onset is achieved within 3 to 7 days. Peak concentrations are achieved after 9 days.",
        "half_life": null,
        "protein_binding": null,
        "route_of_elimination": null,
        "volume_of_distribution": "In studies in rats and monkeys, the initial volume of distribution is similar to the serum volume. Concentrations in sputum decline rapidly after inhalation.",
        "clearance": "Studies in rats indicate that, following aerosol administration, the disappearance half-life of dornase alfa from the lungs is 11 hours. In humans, sputum DNase levels declined below half of those detected immediately post-administration within 2 hours but effects on sputum rheology persisted beyond 12 hours."
    },
    {
        "drugbank_id": "DB00004",
        "name": "Denileukin diftitox",
        "description": "A recombinant DNA-derived cytotoxic protein composed of the amino acid sequences for diphtheria toxin fragments A and B (Met 1-Thr 387)-His followed by the sequences for interleukin-2 (IL-2; Ala 1-Thr 133). It is produced in an E. coli expression system.",
        "cas_number": "173146-27-5",
        "unii": "25E79B5CTM",
        "state": "liquid",
        "synthesis_reference": null,
        "indication": "For treatment of cutaneous T-cell lymphoma",
        "pharmacodynamics": "Denileukin diftitox (Ontak) directs the cytocidal action of diphtheria toxin to cells which express the IL-2 receptor. The human IL-2 receptor exists in three forms, low (CD25), intermediate (CD122/CD132) and high (CD25/CD122/CD132) affinity. Malignant cells expressing one or more of the subunits of the IL-2 receptor are found in certain leukemias and lymphomas including cutaneous T-cell lymphoma (CTCL). Ontak interacts with the high affinity IL-2 receptor on the cell surface and inhibits cellular protein synthesis, resulting in cell death within hours.",
        "mechanism_of_action": "Denileukin diftitox binds to the high-affinity IL-2 receptor complex. The IL-2 receptor (Tac) subunit is expressed on activated but not resting lymphocytes. The diphtheria toxin associated with Ontak then selectively kills the IL-2 bearing cells.",
        "toxicity": null,
        "metabolism": null,
        "absorption": null,
        "half_life": "70-80 min",
        "protein_binding": null,
        "route_of_elimination": null,
        "volume_of_distribution": "* 0.06 to 0.09 L/kg",
        "clearance": "* 0.6 - 2.0 mL/min/kg [Lymphoma]"
    },
    {
        "drugbank_id": "DB00005",
        "name": "Etanercept",
        "description": "Dimeric fusion protein consisting of the extracellular ligand-binding portion of the human 75 kilodalton (p75) tumor necrosis factor receptor (TNFR) linked to the Fc portion of human IgG1.[L14862,A216522] The Fc component of etanercept contains the CH2 domain, the CH3 domain and hinge region, but not the CH1 domain of IgG1. Etanercept is produced by recombinant DNA technology in a Chinese hamster ovary (CHO) mammalian cell expression system. It consists of 934 amino acids. It is used to treat or manage a variety of inflammatory conditions including rheumatoid arthritis (RA), ankylosing spondylitis (AS), and juvenile idiopathic poly-articular arthritis (JIA).",
        "cas_number": "185243-69-0",
        "unii": "OP401G7OJC",
        "state": "liquid",
        "synthesis_reference": "Timothy D. Osslund, Christi L. Clogston, Shon Lee Crampton, Randal B. Bass, \"Crystals of etanercept and methods of making thereof.\" U.S. Patent US07276477, issued October 02, 2007.",
        "indication": "Etanercept is indicated for the treatment of moderately to severely active rheumatoid arthritis in adults and in chronic moderate to severe plaque psoriasis in patients 4 years of age and older.[L14862,L45523] It is also used to manage signs and symptoms of polyarticular idiopathic arthritis and Juvenile Psoriatic Arthritis in those aged 2 years and older. Etanercept is also used to manage the symptoms of psoriatic arthritis and ankylosing spondylitis.[L48526] ",
        "pharmacodynamics": "Etanercept binds specifically to tumor necrosis factor (TNF) and thereby modulates biological processes that are induced or regulated by TNF.[L14862,A216522] Such processes or molecules affected include the level of adhesion molecules expressed, as well as serum levels of cytokines and matrix metalloproteinases.",
        "mechanism_of_action": "There are two distinct receptors for TNF (TNFRs), a 55 kilodalton protein (p55) and a 75 kilodalton protein (p75). The biological activity of TNF is dependent upon binding to either cell surface receptor (p75 or p55).[A216522] Etanercept is a dimeric soluble form of the p75 TNF receptor that can bind to two TNF molecules, thereby effectively removing them from circulation. Notably, etancerpt is only capable of binding to the active trimeric form of TNF as its binding site is located in the cleft between subunits.[A77626]TNF is a naturally occurring cytokine that is involved in normal inflammatory and immune responses.[A216522] Increased levels of TNF are found in tissues and fluids of those with rheumatoid arthritis, psoriatic arthritis, ankylosing spondylitis, and plaque psoriasis. ",
        "toxicity": null,
        "metabolism": "As etanercept is a fusion protein antibody, it is assumed to be metabolized via proteinases similarly to endogenous proteins.",
        "absorption": "Population pharmacokinetic modeling in adults with RA, AS, or who were healthy showed a subcutaneous bioavailability of 56.9% with a Ka of 0.0223/h.[A215352] Another model in pediatric JIA patients showed an increased Ka of 0.05/h with a high mean interindividual variability of 215%.[A215357] Cmax after a single 25 mg subcutaneous dose of Enbrel is reported as 1.1 mcg/L with a Tmax of 69 h.[L14862] Cmax after repeated dosing is reported as 2.4 mcg/L in adult RA patients with a dosage of 25 mg twice weekly and 2.1 mcg in pediatric JIA patients with a dosage of 0.4 mg/kg twice weekly.",
        "half_life": "Etanercept has a mean half-life of elimination of 102 hours in RA patients.[L14862] Population models have shown a mean half-life of 68 hours in healthy adults and 70.7-94.8 hours in pediatric JIA patients.[A215657,A215357]",
        "protein_binding": "No significant protein binding has been identified.",
        "route_of_elimination": null,
        "volume_of_distribution": "Population pharmacokinetic modeling predicts a total Vd of 5.49 L with a peripheral compartment of 1.24 L in adults with RA and an apparent Vd with subcutaneous administration in pediatric JIA patients of 7.88 L.[A215352,A215357]",
        "clearance": "Etanercept has a mean apparent clearance of 160 mL/h in RA patients.[L14862] Population models predict a mean apparent clearance of 132 mL/h in healthy adults and 0.0576 L/h in pediatric JIA patients.[A215657,A215357]"
    }
]